morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
  strip->setPixelColor(0, strip->Color(255, 0, 0));
  strip->show();
  delay(500);
  
  strip->setPixelColor(0, strip->Color(0, 255, 0));
  strip->show();
  delay(500);
  
  strip->setPixelColor(0, strip->Color(0, 0, 255));
  strip->show();
  delay(500);
  
  for(int i = 0; i < 256; i += 32) {
    strip->setPixelColor(0, strip->gamma32(strip->ColorHSV(i * 256)));
    strip->show();
    delay(50);
  }
  
  strip->clear();
  strip->show();
  
  neopixelAvailable = true;
  neopixelTestResult = "Test OK - GPIO " + String(LED_PIN);
  neopixelTested = true;
  Serial.println("NeoPixel: OK");
}

void resetNeoPixelTest() {
  neopixelTested = false;
  neopixelAvailable = false;
  if (strip) {
    strip->clear();
    strip->show();
  }
}

void neopixelRainbow() {
  if (!strip) return;
  for(int i = 0; i < 256; i++) {
    for(int j = 0; j < LED_COUNT; j++) {
      strip->setPixelColor(j, strip->gamma32(strip->ColorHSV(i * 256)));
    }
    strip->show();
    delay(10);
  }
}

void neopixelBlink(uint32_t color, int times) {
  if (!strip) return;
  for(int i = 0; i < times; i++) {
    strip->fill(color);
    strip->show();
    delay(300);
    strip->clear();
    strip->show();
    delay(300);
  }
}

void neopixelFade(uint32_t color) {
  if (!strip) return;
  for(int brightness = 0; brightness <= 255; brightness += 5) {
    strip->setBrightness(brightness);
    strip->fill(color);
    strip->show();
    delay(20);
  }
  for(int brightness = 255; brightness >= 0; brightness -= 5) {
    strip->setBrightness(brightness);
    strip->fill(color);
    strip->show();
    delay(20);
  }
  strip->setBrightness(255);
}

// ========== TFT ==========
void detectTFT() {
  Serial.println("\r\n=== DETECTION TFT ===");
  pinMode(TFT_CS, OUTPUT);
  pinMode(TFT_DC, OUTPUT);
  pinMode(TFT_RST, OUTPUT);
  
  digitalWrite(TFT_RST, LOW);
  delay(20);
  digitalWrite(TFT_RST, HIGH);
  delay(150);
  
  // TFT SPI ne peut pas être détecté automatiquement
  tftAvailable = false; // Par défaut NON détecté
  tftTestResult = "Non teste - Config SPI prete";
  Serial.printf("TFT: Pins configures CS=%d DC=%d RST=%d (test requis)\r\n", TFT_CS, TFT_DC, TFT_RST);
}

void testTFT() {
  if (tftTested) return;
  
  Serial.println("\r\n=== TEST TFT ===");
  tft.init();
  tft.setRotation(1);
  
  tft.fillScreen(TFT_RED);
  delay(500);
  tft.fillScreen(TFT_GREEN);
  delay(500);
  tft.fillScreen(TFT_BLUE);
  delay(500);
  tft.fillScreen(TFT_WHITE);
  delay(500);
  
  tft.fillScreen(TFT_BLACK);
  int sq = 20;
  for(int y = 0; y < 240; y += sq) {
    for(int x = 0; x < 320; x += sq) {
      if ((x/sq + y/sq) % 2 == 0) {
        tft.fillRect(x, y, sq, sq, TFT_WHITE);
      }
    }
  }
  delay(1000);
  
  tft.fillScreen(TFT_NAVY);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(50, 100);
  tft.println("TEST TFT OK");
  delay(2000);
  
  tft.fillScreen(TFT_BLACK);
  
  tftWidth = tft.width();
  tftHeight = tft.height();
  tftAvailable = true;
  tftTestResult = "Test OK - " + String(tftWidth) + "x" + String(tftHeight);
  tftTested = true;
  Serial.println("TFT: OK");
}

void resetTFTTest() {
  tftTested = false;
  tftAvailable = false;
  tft.fillScreen(TFT_BLACK);
}

void tftTestColors() {
  if (!tftAvailable) return;
  tft.fillScreen(TFT_RED);
  delay(300);
  tft.fillScreen(TFT_GREEN);
  delay(300);
  tft.fillScreen(TFT_BLUE);
  delay(300);
  tft.fillScreen(TFT_BLACK);
}

void tftTestCheckerboard() {
  if (!tftAvailable) return;
  tft.fillScreen(TFT_BLACK);
  int sq = 20;
  for(int y = 0; y < 240; y += sq) {
    for(int x = 0; x < 320; x += sq) {
      if ((x/sq + y/sq) % 2 == 0) {
        tft.fillRect(x, y, sq, sq, TFT_WHITE);
      }
    }
  }
}

void tftClear() {
  tft.fillScreen(TFT_BLACK);
}

// ========== OLED 0.96" ==========
void detectOLED() {
  Serial.println("\r\n=== DETECTION OLED ===");
  Wire.begin(I2C_SDA, I2C_SCL);
  Serial.printf("I2C: SDA=%d, SCL=%d\r\n", I2C_SDA, I2C_SCL);
  
  Wire.beginTransmission(SCREEN_ADDRESS);
  bool i2cDetected = (Wire.endTransmission() == 0);
  
  if(i2cDetected && oled.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS)) {
    oledAvailable = true;
    oledTestResult = "Detecte a 0x" + String(SCREEN_ADDRESS, HEX);
    Serial.println("OLED: Detecte!\r\n");
  } else {
    oledAvailable = false;
    if (i2cDetected) {
      oledTestResult = "Peripherique I2C present mais init echoue";
    } else {
      oledTestResult = "Non detecte (SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL) + ")";
    }
    Serial.println("OLED: Non detecte\r\n");
  }
}

void testOLED() {
  if (!oledAvailable || oledTested) return;
  
  Serial.println("\r\n=== TEST OLED ===");
  
  // Test 1: Texte de bienvenue
  oled.clearDisplay();
  oled.setTextSize(1);
  oled.setTextColor(SSD1306_WHITE);
  oled.setCursor(0, 0);
  oled.println("TEST OLED 0.96\"");
  oled.println();
  oled.println("128x64 pixels");
  oled.printf("I2C: 0x%02X\r\n", SCREEN_ADDRESS);
  oled.printf("SDA:%d SCL:%d", I2C_SDA, I2C_SCL);
  oled.display();
  delay(2000);
  
  // Test 2: Texte grand
  oled.clearDisplay();
  oled.setTextSize(2);
  oled.setCursor(20, 20);
  oled.println("ESP32");
  oled.display();
  delay(1500);
  
  // Test 3: Plusieurs tailles de texte
  oled.clearDisplay();
  oled.setTextSize(1);
  oled.setCursor(0, 0);
  oled.println("Taille 1");
  oled.setTextSize(2);
  oled.println("Taille 2");
  oled.setTextSize(1);
  oled.println("Retour taille 1");
  oled.display();
  delay(2000);
  
  // Test 4: Formes géométriques
  oled.clearDisplay();
  oled.drawRect(10, 10, 30, 20, SSD1306_WHITE);      // Rectangle
  oled.fillRect(50, 10, 30, 20, SSD1306_WHITE);      // Rectangle plein
  oled.drawCircle(25, 50, 10, SSD1306_WHITE);        // Cercle
  oled.fillCircle(65, 50, 10, SSD1306_WHITE);        // Cercle plein
  oled.drawTriangle(95, 30, 85, 10, 105, 10, SSD1306_WHITE); // Triangle
  oled.display();
  delay(2000);
  
  // Test 5: Lignes
  oled.clearDisplay();
  for(int i = 0; i < SCREEN_HEIGHT; i += 4) {
    oled.drawLine(0, i, SCREEN_WIDTH, i, SSD1306_WHITE);
  }
  oled.display();
  delay(1500);
  
  // Test 6: Lignes diagonales
  oled.clearDisplay();
  for(int i = 0; i < SCREEN_WIDTH; i += 8) {
    oled.drawLine(0, 0, i, SCREEN_HEIGHT-1, SSD1306_WHITE);
    oled.drawLine(SCREEN_WIDTH-1, 0, i, SCREEN_HEIGHT-1, SSD1306_WHITE);
  }
  oled.display();
  delay(1500);
  
  // Test 7: Animation - carré mobile
  for(int x = 0; x < SCREEN_WIDTH - 20; x += 4) {
    oled.clearDisplay();
    oled.fillRect(x, 22, 20, 20, SSD1306_WHITE);
    oled.display();
    delay(20);
  }
  
  // Test 8: Barre de progression
  oled.clearDisplay();
  oled.setTextSize(1);
  oled.setCursor(20, 10);
  oled.println("Chargement");
  for(int i = 0; i <= 100; i += 5) {
    oled.drawRect(10, 30, 108, 15, SSD1306_WHITE);
    oled.fillRect(12, 32, i, 11, SSD1306_WHITE);
    oled.setCursor(45, 50);
    oled.printf("%d%%", i);
    oled.display();
    delay(100);
    if (i < 100) {
      oled.fillRect(12, 32, i, 11, SSD1306_BLACK); // Effacer la barre
      oled.fillRect(45, 50, 40, 10, SSD1306_BLACK); // Effacer le %
    }
  }
  delay(1000);
  
  // Test 9: Texte défilant
  String scrollText = "  DIAGNOSTIC ESP32 COMPLET - OLED 0.96 pouces I2C  ";
  for(int offset = 0; offset < scrollText.length() * 6; offset += 2) {
    oled.clearDisplay();
    oled.setTextSize(1);
    oled.setCursor(-offset, 28);
    oled.print(scrollText);
    oled.display();
    delay(30);
  }
  
