morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
void handleTFTPattern() {
  if (!server.hasArg("pattern")) {
    server.send(400, "application/json", "{\"success\":false}");
    return;
  }
  
  String pattern = server.arg("pattern");
  String message = "";
  
  if (pattern == "colors") {
    tftTestColors();
    message = "Couleurs OK";
  } else if (pattern == "checkerboard") {
    tftTestCheckerboard();
    message = "Damier OK";
  } else if (pattern == "clear") {
    tftClear();
    tftTested = false;
    message = "Ecran efface";
  } else {
    server.send(400, "application/json", "{\"success\":false}");
    return;
  }
  
  server.send(200, "application/json", "{\"success\":true,\"message\":\"" + message + "\"}");
}

void handleOLEDConfig() {
  if (server.hasArg("sda") && server.hasArg("scl")) {
    int newSDA = server.arg("sda").toInt();
    int newSCL = server.arg("scl").toInt();
    
    if (newSDA >= 0 && newSDA <= 48 && newSCL >= 0 && newSCL <= 48) {
      I2C_SDA = newSDA;
      I2C_SCL = newSCL;
      resetOLEDTest();
      Wire.end();
      detectOLED();
      server.send(200, "application/json", "{\"success\":true,\"message\":\"I2C reconfigure: SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL) + "\"}");
      return;
    }
  }
  server.send(400, "application/json", "{\"success\":false,\"message\":\"Pins invalides\"}");
}

void handleOLEDTest() {
  resetOLEDTest();
  testOLED();
  server.send(200, "application/json", "{\"success\":" + String(oledAvailable ? "true" : "false") + ",\"result\":\"" + oledTestResult + "\"}");
}

void handleOLEDMessage() {
  if (!server.hasArg("message")) {
    server.send(400, "application/json", "{\"success\":false}");
    return;
  }
  
  String message = server.arg("message");
  oledShowMessage(message);
  server.send(200, "application/json", "{\"success\":true,\"message\":\"Message affiche\"}");
}

void handleADCTest() {
  testADC();
  String json = "{\"readings\":[";
  for (size_t i = 0; i < adcReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(adcReadings[i].pin) + ",\"raw\":" + String(adcReadings[i].rawValue) + 
            ",\"voltage\":" + String(adcReadings[i].voltage, 2) + "}";
  }
  json += "],\"result\":\"" + adcTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handleTouchTest() {
  testTouchPads();
  String json = "{\"readings\":[";
  for (size_t i = 0; i < touchReadings.size(); i++) {
    if (i > 0) json += ",";
    json += "{\"pin\":" + String(touchReadings[i].pin) + ",\"value\":" + String(touchReadings[i].value) + "}";
  }
  json += "],\"result\":\"" + touchTestResult + "\"}";
  server.send(200, "application/json", json);
}

void handlePWMTest() {
  testPWM();
  server.send(200, "application/json", "{\"result\":\"" + pwmTestResult + "\"}");
}

void handleSPIScan() {
  scanSPI();
  server.send(200, "application/json", "{\"info\":\"" + spiInfo + "\"}");
}

void handlePartitionsList() {
  listPartitions();
  server.send(200, "application/json", "{\"partitions\":\"" + partitionsInfo + "\"}");
}

void handleStressTest() {
  memoryStressTest();
  server.send(200, "application/json", "{\"result\":\"" + stressTestResult + "\"}");
}

void handleBenchmark() {
  unsigned long cpuTime = benchmarkCPU();
  unsigned long memTime = benchmarkMemory();
  
  diagnosticData.cpuBenchmark = cpuTime;
  diagnosticData.memBenchmark = memTime;
  
  server.send(200, "application/json", "{\"cpu\":" + String(cpuTime) + ",\"memory\":" + String(memTime) + 
              ",\"cpuPerf\":" + String(100000.0 / cpuTime, 2) + ",\"memSpeed\":" + String((10000 * sizeof(int) * 2) / (float)memTime, 2) + "}");
}

void handleMemoryDetails() {
  collectDetailedMemory();
  
  String json = "{\"flash\":{\"real\":" + String(detailedMemory.flashSizeReal) + ",\"chip\":" + String(detailedMemory.flashSizeChip) + "},";
  json += "\"psram\":{\"available\":" + String(detailedMemory.psramAvailable ? "true" : "false") + 
          ",\"configured\":" + String(detailedMemory.psramConfigured ? "true" : "false") + 
          ",\"total\":" + String(detailedMemory.psramTotal) + ",\"free\":" + String(detailedMemory.psramFree) + "},";
  json += "\"sram\":{\"total\":" + String(detailedMemory.sramTotal) + ",\"free\":" + String(detailedMemory.sramFree) + "},";
  json += "\"fragmentation\":" + String(detailedMemory.fragmentationPercent, 1) + ",\"status\":\"" + detailedMemory.memoryStatus + "\"}";
  
  server.send(200, "application/json", json);
}

// ========== EXPORTS ==========
void handleExportTXT() {
  collectDiagnosticInfo();
  collectDetailedMemory();
  
  String txt = "========================================\r\n";
  txt += String("DIAGNOSTIC COMPLET ESP32 ") + DIAGNOSTIC_VERSION + "\r\n";
  txt += "========================================\r\n\r\n";
  
  txt += "=== CHIP ===\r\n";
  txt += "Modele: " + diagnosticData.chipModel + " Rev" + diagnosticData.chipRevision + "\r\n";
  txt += "CPU: " + String(diagnosticData.cpuCores) + " coeurs @ " + String(diagnosticData.cpuFreqMHz) + " MHz\r\n";
  txt += "MAC WiFi: " + diagnosticData.macAddress + "\r\n";
  txt += "SDK: " + diagnosticData.sdkVersion + "\r\n";
  txt += "ESP-IDF: " + diagnosticData.idfVersion + "\r\n";
  if (diagnosticData.temperature != -999) {
    txt += "Temperature: " + String(diagnosticData.temperature, 1) + " °C\r\n";
  }
  txt += "\r\n";
  
  txt += "=== MEMOIRE ===\r\n";
  txt += "Flash (carte): " + String(detailedMemory.flashSizeReal / 1048576.0, 2) + " MB\r\n";
  txt += "Flash (IDE): " + String(detailedMemory.flashSizeChip / 1048576.0, 2) + " MB\r\n";
  txt += "Type Flash: " + getFlashType() + " @ " + getFlashSpeed() + "\r\n";
  txt += "PSRAM: " + String(detailedMemory.psramTotal / 1048576.0, 2) + " MB";
  if (detailedMemory.psramAvailable) {
    txt += " (Libre: " + String(detailedMemory.psramFree / 1048576.0, 2) + " MB)\r\n";
  } else {
    txt += " (Non detectee)\r\n";
  }
  txt += "SRAM: " + String(detailedMemory.sramTotal / 1024.0, 2) + " KB";
  txt += " (Libre: " + String(detailedMemory.sramFree / 1024.0, 2) + " KB)\r\n";
  txt += "Fragmentation: " + String(detailedMemory.fragmentationPercent, 1) + "%\r\n";
  txt += "Etat memoire: " + detailedMemory.memoryStatus + "\r\n";
  txt += "\r\n";
  
  txt += "=== WIFI ===\r\n";
  txt += "SSID: " + diagnosticData.wifiSSID + "\r\n";
  txt += "RSSI: " + String(diagnosticData.wifiRSSI) + " dBm (" + getWiFiSignalQuality() + ")\r\n";
  txt += "IP: " + diagnosticData.ipAddress + "\r\n";
  txt += "Masque: " + WiFi.subnetMask().toString() + "\r\n";
  txt += "Passerelle: " + WiFi.gatewayIP().toString() + "\r\n";
  txt += "DNS: " + WiFi.dnsIP().toString() + "\r\n";
  txt += "\r\n";
  
  txt += "=== GPIO ===\r\n";
  txt += "Total GPIO: " + String(diagnosticData.totalGPIO) + "\r\n";
  txt += "Liste: " + diagnosticData.gpioList + "\r\n";
  txt += "\r\n";
  
  txt += "=== PERIPHERIQUES ===\r\n";
  txt += "I2C: " + String(diagnosticData.i2cCount) + " peripherique(s) - " + diagnosticData.i2cDevices + "\r\n";
  txt += "SPI: " + spiInfo + "\r\n";
  txt += "\r\n";
  
  txt += "=== TESTS MATERIELS ===\r\n";
  txt += "LED integree: " + builtinLedTestResult + "\r\n";
  txt += "NeoPixel: " + neopixelTestResult + "\r\n";
  txt += "TFT: " + tftTestResult + "\r\n";
  txt += "OLED: " + oledTestResult + "\r\n";
  txt += "ADC: " + adcTestResult + "\r\n";
  txt += "Touch: " + touchTestResult + "\r\n";
  txt += "PWM: " + pwmTestResult + "\r\n";
  txt += "\r\n";
  
  txt += "=== PERFORMANCE ===\r\n";
  if (diagnosticData.cpuBenchmark > 0) {
    txt += "CPU: " + String(diagnosticData.cpuBenchmark) + " us (" + String(100000.0 / diagnosticData.cpuBenchmark, 2) + " MFLOPS)\r\n";
    txt += "Memoire: " + String(diagnosticData.memBenchmark) + " us\r\n";
  } else {
    txt += "Benchmarks non executes\r\n";
  }
  txt += "Stress test: " + stressTestResult + "\r\n";
  txt += "\r\n";
  
  unsigned long seconds = diagnosticData.uptime / 1000;
  unsigned long minutes = seconds / 60;
  unsigned long hours = minutes / 60;
  unsigned long days = hours / 24;
  txt += "=== SYSTEME ===\r\n";
  txt += "Uptime: " + String(days) + "j " + String(hours % 24) + "h " + String(minutes % 60) + "m\r\n";
  txt += "Raison reset: " + getResetReason() + "\r\n";
  txt += "\r\n";
  txt += "========================================\r\n";
  txt += "Rapport genere le " + String(millis()/1000) + "s apres demarrage\r\n";
  txt += "========================================\r\n";
  
  server.sendHeader("Content-Disposition", "attachment; filename=esp32_diagnostic_v23.txt");
  server.send(200, "text/plain; charset=utf-8", txt);
}

void handleExportJSON() {
  collectDiagnosticInfo();
  collectDetailedMemory();
  
  String json = "{";
  json += "\"chip\":{";
  json += "\"model\":\"" + diagnosticData.chipModel + "\",";
  json += "\"revision\":\"" + diagnosticData.chipRevision + "\",";
  json += "\"cores\":" + String(diagnosticData.cpuCores) + ",";
  json += "\"freq_mhz\":" + String(diagnosticData.cpuFreqMHz) + ",";
  json += "\"mac\":\"" + diagnosticData.macAddress + "\",";
  json += "\"sdk\":\"" + diagnosticData.sdkVersion + "\",";
  json += "\"idf\":\"" + diagnosticData.idfVersion + "\"";
  if (diagnosticData.temperature != -999) {
    json += ",\"temperature\":" + String(diagnosticData.temperature, 1);
  }
  json += "},";
  
