morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
  // ===== CHUNK 2: HEADER + NAVIGATION =====
  chunk = "<div class='container'><div class='header'>";
  chunk += "<h1>Diagnostic ESP32 Exhaustif v" + String(DIAGNOSTIC_VERSION) + "</h1>";
  chunk += "<div style='font-size:1.2em;margin:10px 0'>" + diagnosticData.chipModel + "</div>";
  chunk += "<div style='font-size:.9em;opacity:.9;margin:10px 0'>";
  chunk += "Acces: <a href='http://" + String(MDNS_HOSTNAME) + ".local' style='color:#fff;text-decoration:underline'><strong>http://" + String(MDNS_HOSTNAME) + ".local</strong></a> ou <strong>" + diagnosticData.ipAddress + "</strong>";
  chunk += "</div>";
  chunk += "<div class='nav'>";
  chunk += "<button class='nav-btn active' onclick='showTab(\"overview\")'>Vue d ensemble</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"leds\")'>LEDs</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"screens\")'>Ecrans</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"tests\")'>Tests Avances</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"gpio\")'>GPIO</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"wifi\")'>WiFi</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"benchmark\")'>Performance</button>";
  chunk += "<button class='nav-btn' onclick='showTab(\"export\")'>Export</button>";
  chunk += "</div></div><div class='content'>";
  server.sendContent(chunk);
  
  // ===== CHUNK 3: TAB OVERVIEW (partie 1 - Chip) =====
  chunk = "<div id='overview' class='tab-content active'>";
  chunk += "<div class='section'><h2>Informations Chip Detaillees</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Modele Complet</div><div class='info-value'>" + diagnosticData.chipModel + " Rev" + diagnosticData.chipRevision + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Coeurs CPU</div><div class='info-value'>" + String(diagnosticData.cpuCores) + " coeurs @ " + String(diagnosticData.cpuFreqMHz) + " MHz</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Adresse MAC WiFi</div><div class='info-value'>" + diagnosticData.macAddress + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Raison Dernier Reset</div><div class='info-value'>" + getResetReason() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Fonctionnalites Chip</div><div class='info-value'>" + getChipFeatures() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>SDK Version</div><div class='info-value'>" + diagnosticData.sdkVersion + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>ESP-IDF Version</div><div class='info-value'>" + diagnosticData.idfVersion + "</div></div>";
  
  unsigned long seconds = diagnosticData.uptime / 1000;
  unsigned long minutes = seconds / 60;
  unsigned long hours = minutes / 60;
  unsigned long days = hours / 24;
  chunk += "<div class='info-item'><div class='info-label'>Uptime</div><div class='info-value'>" + String(days) + "j " + String(hours % 24) + "h " + String(minutes % 60) + "m " + String(seconds % 60) + "s</div></div>";
  
  if (diagnosticData.temperature != -999) {
    chunk += "<div class='info-item'><div class='info-label'>Temperature CPU</div><div class='info-value'>" + String(diagnosticData.temperature, 1) + " °C</div></div>";
  }
  chunk += "</div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 4: TAB OVERVIEW (partie 2 - Mémoire Flash) =====
  chunk = "<div class='section'><h2>Memoire Detaillee</h2>";
  chunk += "<h3>Flash Memory</h3><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Taille Reelle (carte)</div><div class='info-value'>" + String(detailedMemory.flashSizeReal / 1048576.0, 2) + " MB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Configuree (IDE)</div><div class='info-value'>" + String(detailedMemory.flashSizeChip / 1048576.0, 2) + " MB</div></div>";
  
  bool flashMatch = (detailedMemory.flashSizeReal == detailedMemory.flashSizeChip);
  chunk += "<div class='info-item'><div class='info-label'>Configuration</div><div class='info-value'><span class='badge ";
  chunk += flashMatch ? "badge-success'>Correcte" : "badge-warning'>A corriger";
  chunk += "</span></div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Type Flash</div><div class='info-value'>" + getFlashType() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Vitesse Flash</div><div class='info-value'>" + getFlashSpeed() + "</div></div>";
  
  if (!flashMatch) {
    chunk += "<div class='info-item' style='grid-column:1/-1;background:#fff3cd;border-left:4px solid #ffc107;padding:15px'>";
    chunk += "<div class='info-label'>Action Requise</div><div class='info-value' style='color:#856404'>";
    chunk += "Arduino IDE: Tools → Flash Size → " + String(detailedMemory.flashSizeReal / 1048576.0, 0) + "MB</div></div>";
  }
  chunk += "</div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 5: PSRAM =====
  chunk = "<h3>PSRAM (Memoire Externe)</h3><div class='info-grid'>";
  if (detailedMemory.psramAvailable) {
    chunk += "<div class='info-item'><div class='info-label'>Statut Hardware</div><div class='info-value'><span class='badge badge-success'>Detectee et active</span></div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Configuration IDE</div><div class='info-value'><span class='badge badge-success'>Activee</span></div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Taille Totale</div><div class='info-value'>" + String(detailedMemory.psramTotal / 1048576.0, 2) + " MB</div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Libre</div><div class='info-value'>" + String(detailedMemory.psramFree / 1048576.0, 2) + " MB</div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Utilisee</div><div class='info-value'>" + String(detailedMemory.psramUsed / 1048576.0, 2) + " MB</div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Plus Gros Bloc</div><div class='info-value'>" + String(detailedMemory.psramLargestBlock / 1024.0, 2) + " KB</div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Test Integrite</div><div class='info-value'><span class='badge ";
    chunk += detailedMemory.psramTestPassed ? "badge-success'>OK" : "badge-danger'>FAIL";
    chunk += "</span></div></div>";
    
