morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
    float psramUsagePercent = (float)detailedMemory.psramUsed / detailedMemory.psramTotal * 100;
    chunk += "<div class='info-item' style='grid-column:1/-1'>";
    chunk += "<div class='info-label'>Utilisation PSRAM</div>";
    chunk += "<div class='progress-bar'><div class='progress-fill' style='width:" + String(psramUsagePercent, 1) + "%;background:linear-gradient(90deg,#4CAF50,#2196F3)'></div></div>";
    chunk += "<div style='text-align:center;margin-top:5px'>" + String(psramUsagePercent, 1) + "% utilisee</div>";
    chunk += "</div>";
  } else {
    chunk += "<div class='info-item'><div class='info-label'>Statut Hardware</div><div class='info-value'><span class='badge badge-danger'>Non detectee</span></div></div>";
    chunk += "<div class='info-item'><div class='info-label'>Configuration IDE</div><div class='info-value'><span class='badge ";
    chunk += detailedMemory.psramConfigured ? "badge-warning'>Activee" : "badge-danger'>Desactivee";
    chunk += "</span></div></div>";
    chunk += "<div class='info-item' style='grid-column:1/-1;background:";
    chunk += detailedMemory.psramConfigured ? "#fff3cd" : "#f8d7da";
    chunk += ";border-left:4px solid ";
    chunk += detailedMemory.psramConfigured ? "#ffc107" : "#dc3545";
    chunk += ";padding:15px'><div class='info-label'>";
    chunk += detailedMemory.psramConfigured ? "Configuration PSRAM" : "PSRAM Desactivee";
    chunk += "</div><div class='info-value' style='color:";
    chunk += detailedMemory.psramConfigured ? "#856404" : "#721c24";
    chunk += "'>";
    if (detailedMemory.psramConfigured) {
      chunk += "PSRAM activee dans l'IDE mais non detectee materiellement.<br><br><strong>Verifications:</strong><br>1. Votre carte possede-t-elle reellement de la PSRAM ?<br>2. Essayez un type different: <strong>Tools → PSRAM → OPI PSRAM</strong> ou <strong>QSPI PSRAM</strong><br>3. Faites un <strong>Clean</strong> puis recompiler completement<br>";
    } else {
      chunk += "PSRAM desactivee dans Arduino IDE.<br><br>Si votre carte possede de la PSRAM:<br>1. <strong>Tools → PSRAM → OPI PSRAM</strong> (pour ESP32-S3) ou <strong>QSPI PSRAM</strong> (pour ESP32)<br>2. Recompiler et televerser<br>";
    }
    chunk += "</div></div>";
  }
  chunk += "</div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 6: SRAM + Analyse globale =====
  chunk = "<h3>SRAM Interne</h3><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Totale</div><div class='info-value'>" + String(detailedMemory.sramTotal / 1024.0, 2) + " KB (" + String(detailedMemory.sramTotal) + " octets)</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Libre</div><div class='info-value'>" + String(detailedMemory.sramFree / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Utilisee</div><div class='info-value'>" + String(detailedMemory.sramUsed / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Plus Gros Bloc</div><div class='info-value'>" + String(detailedMemory.sramLargestBlock / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Min Libre (Record)</div><div class='info-value'>" + String(diagnosticData.minFreeHeap / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Max Allocation</div><div class='info-value'>" + String(diagnosticData.maxAllocHeap / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Test Integrite</div><div class='info-value'><span class='badge ";
  chunk += detailedMemory.sramTestPassed ? "badge-success'>OK" : "badge-danger'>FAIL";
  chunk += "</span></div></div>";
  
  float sramUsagePercent = (float)detailedMemory.sramUsed / detailedMemory.sramTotal * 100;
  chunk += "<div class='info-item' style='grid-column:1/-1'>";
  chunk += "<div class='info-label'>Utilisation SRAM</div>";
  chunk += "<div class='progress-bar'><div class='progress-fill' style='width:" + String(sramUsagePercent, 1) + "%;background:linear-gradient(90deg,#4CAF50,#FF9800,#F44336)'></div></div>";
  chunk += "<div style='text-align:center;margin-top:5px'>" + String(sramUsagePercent, 1) + "% utilisee</div>";
  chunk += "</div></div>";
  
  chunk += "<h3>Analyse Globale</h3><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Fragmentation Memoire</div><div class='info-value'>" + String(detailedMemory.fragmentationPercent, 1) + "%</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Etat Memoire</div><div class='info-value'><span class='badge ";
  if (detailedMemory.fragmentationPercent < 20) chunk += "badge-success";
  else if (detailedMemory.fragmentationPercent < 40) chunk += "badge-success";
  else if (detailedMemory.fragmentationPercent < 60) chunk += "badge-warning";
  else chunk += "badge-danger";
  chunk += "'>" + detailedMemory.memoryStatus + "</span></div></div>";
  
  uint32_t totalRAM = detailedMemory.sramTotal + detailedMemory.psramTotal;
  uint32_t freeRAM = detailedMemory.sramFree + detailedMemory.psramFree;
  chunk += "<div class='info-item'><div class='info-label'>RAM Totale (SRAM+PSRAM)</div><div class='info-value'>" + String(totalRAM / 1024.0, 2) + " KB</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>RAM Libre Totale</div><div class='info-value'>" + String(freeRAM / 1024.0, 2) + " KB</div></div>";
  chunk += "</div>";
  chunk += "<div style='text-align:center;margin-top:15px'>";
  chunk += "<button class='btn btn-info' onclick='location.reload()'>Actualiser Memoire</button>";
  chunk += "</div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 7: WiFi + GPIO + I2C =====
  chunk = "<div class='section'><h2>Connexion WiFi Detaillee</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>SSID Connecte</div><div class='info-value'>" + diagnosticData.wifiSSID + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Puissance Signal (RSSI)</div><div class='info-value'>" + String(diagnosticData.wifiRSSI) + " dBm</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Qualite Signal</div><div class='info-value'>" + getWiFiSignalQuality() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Adresse IP</div><div class='info-value'>" + diagnosticData.ipAddress + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Masque Sous-reseau</div><div class='info-value'>" + WiFi.subnetMask().toString() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Passerelle</div><div class='info-value'>" + WiFi.gatewayIP().toString() + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>DNS</div><div class='info-value'>" + WiFi.dnsIP().toString() + "</div></div>";
  if (WiFi.status() == WL_CONNECTED) {
    chunk += "<div class='info-item'><div class='info-label'>Canal WiFi</div><div class='info-value'>Canal " + String(WiFi.channel()) + "</div></div>";
  }
  chunk += "</div></div>";
  
