morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
  chunk += "<div class='section'><h2>GPIO et Interfaces</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Total GPIO</div><div class='info-value'>" + String(diagnosticData.totalGPIO) + " broches</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1'><div class='info-label'>Liste GPIO</div><div class='info-value' style='font-family:monospace;background:#f0f0f0;padding:10px;border-radius:5px'>" + diagnosticData.gpioList + "</div></div>";
  chunk += "</div></div>";
  
  if (ENABLE_I2C_SCAN) {
    chunk += "<div class='section'><h2>Peripheriques I2C</h2><div class='info-grid'>";
    chunk += "<div class='info-item'><div class='info-label'>Nombre de Peripheriques</div><div class='info-value'>" + String(diagnosticData.i2cCount) + "</div></div>";
    if (diagnosticData.i2cCount > 0) {
      chunk += "<div class='info-item' style='grid-column:1/-1'><div class='info-label'>Adresses Detectees</div><div class='info-value' style='font-family:monospace'>" + diagnosticData.i2cDevices + "</div></div>";
    }
    chunk += "</div><button class='btn btn-info' onclick='scanI2C()'>Re-scanner I2C</button></div>";
  }
  chunk += "</div>";
  server.sendContent(chunk);

// ===== CHUNK 8: TAB LEDs =====
  chunk = "<div id='leds' class='tab-content'>";
  chunk += "<div class='section'><h2>LED Integree</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>GPIO</div><div class='info-value'>GPIO " + String(BUILTIN_LED_PIN) + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Statut</div><div class='info-value' id='builtin-led-status'>" + builtinLedTestResult + "</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "<input type='number' id='ledGPIO' value='" + String(BUILTIN_LED_PIN) + "' min='0' max='48' style='width:80px'>";
  chunk += "<button class='btn btn-info' onclick='configBuiltinLED()'>Config</button>";
  chunk += "<button class='btn btn-primary' onclick='testBuiltinLED()'>Test</button>";
  chunk += "<button class='btn btn-success' onclick='ledBlink()'>Blink</button>";
  chunk += "<button class='btn btn-info' onclick='ledFade()'>Fade</button>";
  chunk += "<button class='btn btn-danger' onclick='ledOff()'>Off</button>";
  chunk += "</div></div></div>";
  
  chunk += "<div class='section'><h2>NeoPixel</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>GPIO</div><div class='info-value'>GPIO " + String(LED_PIN) + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Statut</div><div class='info-value' id='neopixel-status'>" + neopixelTestResult + "</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "<input type='number' id='neoGPIO' value='" + String(LED_PIN) + "' min='0' max='48' style='width:80px'>";
  chunk += "<input type='number' id='neoCount' value='" + String(LED_COUNT) + "' min='1' max='100' style='width:80px'>";
  chunk += "<button class='btn btn-info' onclick='configNeoPixel()'>Config</button>";
  chunk += "<button class='btn btn-primary' onclick='testNeoPixel()'>Test</button>";
  chunk += "<button class='btn btn-primary' onclick='neoPattern(\"rainbow\")'>Rainbow</button>";
  chunk += "<input type='color' id='neoColor' value='#ff0000' style='height:48px'>";
  chunk += "<button class='btn btn-primary' onclick='neoCustomColor()'>Couleur</button>";
  chunk += "<button class='btn btn-danger' onclick='neoPattern(\"off\")'>Off</button>";
  chunk += "</div></div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 9: TAB Écrans =====
  chunk = "<div id='screens' class='tab-content'>";
  chunk += "<div class='section'><h2>Ecran TFT 320x240</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Statut</div><div class='info-value' id='tft-status'>";
  if (tftTested && tftAvailable) {
    chunk += "<span class='badge badge-success'>Test OK - " + String(tftWidth) + "x" + String(tftHeight) + "</span>";
  } else if (tftTested && !tftAvailable) {
    chunk += "<span class='badge badge-danger'>Test echoue</span>";
  } else {
    chunk += "<span class='badge badge-warning'>" + tftTestResult + "</span>";
  }
  chunk += "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Pins SPI</div><div class='info-value'>CS:" + String(TFT_CS) + " DC:" + String(TFT_DC) + " RST:" + String(TFT_RST) + "</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  chunk += "<button class='btn btn-primary' onclick='testTFT()'>Test Complet</button>";
  chunk += "<button class='btn btn-success' onclick='tftPattern(\"colors\")'>Couleurs</button>";
  chunk += "<button class='btn btn-info' onclick='tftPattern(\"checkerboard\")'>Damier</button>";
  chunk += "<button class='btn btn-danger' onclick='tftPattern(\"clear\")'>Effacer</button>";
  chunk += "</div></div></div>";
  
  chunk += "<div class='section'><h2>Ecran OLED 0.96\" I2C</h2><div class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>Statut</div><div class='info-value' id='oled-status'>";
  if (oledAvailable && oledTested) {
    chunk += "<span class='badge badge-success'>Test OK - 128x64</span>";
  } else if (oledAvailable && !oledTested) {
    chunk += "<span class='badge badge-success'>Detecte (non teste)</span>";
  } else {
    chunk += "<span class='badge badge-danger'>Non detecte</span>";
  }
  chunk += "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Pins I2C</div><div class='info-value'>SDA:" + String(I2C_SDA) + " SCL:" + String(I2C_SCL) + "</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Adresse I2C</div><div class='info-value'>0x" + String(SCREEN_ADDRESS, HEX);
  if (!oledAvailable) chunk += " <span style='color:#dc3545'>(aucun peripherique)</span>";
  chunk += "</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1;background:#f0f0f0;padding:15px;border-radius:8px'>";
  chunk += "<div class='info-label' style='margin-bottom:10px'>⚙️ Configuration Pins I2C</div>";
  chunk += "<div style='display:flex;gap:10px;align-items:center;flex-wrap:wrap'>";
  chunk += "SDA: <input type='number' id='oledSDA' value='" + String(I2C_SDA) + "' min='0' max='48' style='width:70px'>";
  chunk += "SCL: <input type='number' id='oledSCL' value='" + String(I2C_SCL) + "' min='0' max='48' style='width:70px'>";
  chunk += "<button class='btn btn-info' onclick='configOLED()'>Appliquer et Re-detecter</button>";
  chunk += "</div><div style='margin-top:8px;font-size:0.9em;color:#666'>Modifie les pins I2C et relance la detection</div></div>";
  chunk += "<div class='info-item' style='grid-column:1/-1;text-align:center'>";
  if (oledAvailable) {
    chunk += "<button class='btn btn-primary' onclick='testOLED()'>Test Complet</button>";
    chunk += "<input type='text' id='oledMsg' placeholder='Message personnalise' style='width:250px;margin:0 5px'>";
    chunk += "<button class='btn btn-success' onclick='oledMessage()'>Afficher Message</button>";
    chunk += "<button class='btn btn-danger' onclick='oledClear()'>Effacer</button>";
  } else {
    chunk += "<div style='color:#dc3545;padding:15px;background:#f8d7da;border-radius:8px'>";
    chunk += "⚠️ Aucun ecran OLED detecte. Verifiez le cablage et les pins I2C ci-dessus.</div>";
  }
  chunk += "</div></div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 10: TAB Tests Avancés =====
  chunk = "<div id='tests' class='tab-content'>";
  chunk += "<div class='section'><h2>Test ADC</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testADC()'>Tester ADC</button>";
  chunk += "<div id='adc-status' class='status-live'>" + adcTestResult + "</div>";
  chunk += "</div><div id='adc-results' class='info-grid'></div></div>";
  
