morfredus/ESP32-Diagnostic-Arduino-IDE/Test_ESP32_UNIVERSAL.ino
  chunk += "<div class='section'><h2>Test Touch Pads</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testTouch()'>Tester Touch Pads</button>";
  chunk += "<div id='touch-status' class='status-live'>" + touchTestResult + "</div>";
  chunk += "</div><div id='touch-results' class='info-grid'></div></div>";
  
  chunk += "<div class='section'><h2>Test PWM</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testPWM()'>Tester PWM</button>";
  chunk += "<div id='pwm-status' class='status-live'>" + pwmTestResult + "</div>";
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2>Bus SPI</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='scanSPI()'>Scanner SPI</button>";
  chunk += "<div id='spi-status' class='status-live'>" + (spiInfo.length() > 0 ? spiInfo : "Non scanne") + "</div>";
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2>Partitions Flash</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='listPartitions()'>Lister Partitions</button>";
  chunk += "</div><div id='partitions-results' style='background:#fff;padding:15px;border-radius:10px;font-family:monospace;white-space:pre-wrap;font-size:0.85em'>";
  chunk += partitionsInfo.length() > 0 ? partitionsInfo : "Cliquez sur le bouton";
  chunk += "</div></div>";
  
  chunk += "<div class='section'><h2>Stress Test Memoire</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-danger' onclick='stressTest()'>Lancer Stress Test</button>";
  chunk += "<div id='stress-status' class='status-live'>" + stressTestResult + "</div>";
  chunk += "</div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 11: TAB GPIO =====
  chunk = "<div id='gpio' class='tab-content'>";
  chunk += "<div class='section'><h2>Test GPIO</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='testAllGPIO()'>Tester Tous les GPIO</button>";
  chunk += "<div id='gpio-status' class='status-live'>Cliquez pour tester</div>";
  chunk += "</div><div id='gpio-results' class='gpio-grid'></div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 12: TAB WiFi =====
  chunk = "<div id='wifi' class='tab-content'>";
  chunk += "<div class='section'><h2>Scanner WiFi</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='scanWiFi()'>Scanner Reseaux WiFi</button>";
  chunk += "<div id='wifi-status' class='status-live'>Cliquez pour scanner</div>";
  chunk += "</div><div id='wifi-results' class='wifi-list'></div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 13: TAB Benchmark =====
  chunk = "<div id='benchmark' class='tab-content'>";
  chunk += "<div class='section'><h2>Benchmarks de Performance</h2>";
  chunk += "<div style='text-align:center;margin:20px 0'>";
  chunk += "<button class='btn btn-primary' onclick='runBenchmarks()'>Lancer Benchmarks</button>";
  chunk += "</div><div id='benchmark-results' class='info-grid'>";
  chunk += "<div class='info-item'><div class='info-label'>CPU Benchmark</div><div class='info-value' id='cpu-bench'>Non teste</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Memoire Benchmark</div><div class='info-value' id='mem-bench'>Non teste</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Performance CPU</div><div class='info-value' id='cpu-perf'>-</div></div>";
  chunk += "<div class='info-item'><div class='info-label'>Vitesse Memoire</div><div class='info-value' id='mem-speed'>-</div></div>";
  chunk += "</div></div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 14: TAB Export =====
  chunk = "<div id='export' class='tab-content'>";
  chunk += "<div class='section'><h2>Export des Donnees</h2>";
  chunk += "<div style='display:grid;grid-template-columns:repeat(auto-fit,minmax(200px,1fr));gap:20px;margin-top:20px'>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #667eea'>";
  chunk += "<h3 style='color:#667eea;margin-bottom:15px'>Fichier TXT</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>Rapport texte lisible</p>";
  chunk += "<a href='/export/txt' class='btn btn-primary'>Telecharger TXT</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #3a7bd5'>";
  chunk += "<h3 style='color:#3a7bd5;margin-bottom:15px'>Fichier JSON</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>Format structure</p>";
  chunk += "<a href='/export/json' class='btn btn-info'>Telecharger JSON</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #56ab2f'>";
  chunk += "<h3 style='color:#56ab2f;margin-bottom:15px'>Fichier CSV</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>Pour Excel</p>";
  chunk += "<a href='/export/csv' class='btn btn-success'>Telecharger CSV</a></div>";
  chunk += "<div style='text-align:center;padding:30px;background:#fff;border-radius:10px;border:2px solid #667eea'>";
  chunk += "<h3 style='color:#667eea;margin-bottom:15px'>Version Imprimable</h3>";
  chunk += "<p style='font-size:0.9em;color:#666;margin-bottom:15px'>Format PDF</p>";
  chunk += "<a href='/print' target='_blank' class='btn btn-primary'>Ouvrir</a></div>";
  chunk += "</div></div></div>";
  chunk += "</div></div>";
  server.sendContent(chunk);
  
  // ===== CHUNK 15: JavaScript (partie 1) =====
  chunk = "<script>";
  chunk += "function showTab(t){";
  chunk += "document.querySelectorAll('.tab-content').forEach(e=>e.classList.remove('active'));";
  chunk += "document.querySelectorAll('.nav-btn').forEach(e=>e.classList.remove('active'));";
  chunk += "var target=document.getElementById(t);";
  chunk += "if(target){target.classList.add('active');console.log('Onglet active:',t)}";
  chunk += "else{console.error('Onglet introuvable:',t)}";
  chunk += "var btns=document.querySelectorAll('.nav-btn');";
  chunk += "for(var i=0;i<btns.length;i++){";
  chunk += "if(btns[i].textContent.toLowerCase().replace(/ /g,'').includes(t.toLowerCase())){";
  chunk += "btns[i].classList.add('active');break}}";
  chunk += "}";
  
  chunk += "function configBuiltinLED(){fetch('/api/builtin-led-config?gpio='+document.getElementById('ledGPIO').value)";
  chunk += ".then(r=>r.json()).then(d=>{document.getElementById('builtin-led-status').innerHTML=d.message;alert(d.message)})}";
  chunk += "function testBuiltinLED(){document.getElementById('builtin-led-status').innerHTML='Test...';";
  chunk += "fetch('/api/builtin-led-test').then(r=>r.json()).then(d=>{document.getElementById('builtin-led-status').innerHTML=d.result;alert(d.result)})}";
  chunk += "function ledBlink(){fetch('/api/builtin-led-control?action=blink').then(r=>r.json()).then(d=>document.getElementById('builtin-led-status').innerHTML=d.message)}";
  chunk += "function ledFade(){fetch('/api/builtin-led-control?action=fade').then(r=>r.json()).then(d=>document.getElementById('builtin-led-status').innerHTML=d.message)}";
  chunk += "function ledOff(){fetch('/api/builtin-led-control?action=off').then(r=>r.json()).then(d=>document.getElementById('builtin-led-status').innerHTML=d.message)}";
  
  chunk += "function configNeoPixel(){fetch('/api/neopixel-config?gpio='+document.getElementById('neoGPIO').value+'&count='+document.getElementById('neoCount').value)";
  chunk += ".then(r=>r.json()).then(d=>{document.getElementById('neopixel-status').innerHTML=d.message;alert(d.message)})}";
  chunk += "function testNeoPixel(){fetch('/api/neopixel-test').then(r=>r.json()).then(d=>document.getElementById('neopixel-status').innerHTML=d.result)}";
  chunk += "function neoPattern(p){fetch('/api/neopixel-pattern?pattern='+p).then(r=>r.json()).then(d=>document.getElementById('neopixel-status').innerHTML=d.message)}";
  chunk += "function neoCustomColor(){const c=document.getElementById('neoColor').value;";
  chunk += "const r=parseInt(c.substr(1,2),16),g=parseInt(c.substr(3,2),16),b=parseInt(c.substr(5,2),16);";
  chunk += "fetch('/api/neopixel-color?r='+r+'&g='+g+'&b='+b).then(r=>r.json()).then(d=>document.getElementById('neopixel-status').innerHTML=d.message)}";
  server.sendContent(chunk);
  
  // ===== CHUNK 16: JavaScript (partie 2) =====
  chunk = "function testTFT(){document.getElementById('tft-status').innerHTML='Test en cours (15s)...';";
  chunk += "fetch('/api/tft-test').then(r=>r.json()).then(d=>document.getElementById('tft-status').innerHTML=d.result)}";
  chunk += "function tftPattern(p){fetch('/api/tft-pattern?pattern='+p).then(r=>r.json()).then(d=>document.getElementById('tft-status').innerHTML=d.message)}";
  
  chunk += "function testOLED(){document.getElementById('oled-status').innerHTML='Test en cours (25s)...';";
  chunk += "fetch('/api/oled-test').then(r=>r.json()).then(d=>document.getElementById('oled-status').innerHTML=d.result)}";
  chunk += "function oledMessage(){fetch('/api/oled-message?message='+encodeURIComponent(document.getElementById('oledMsg').value))";
  chunk += ".then(r=>r.json()).then(d=>document.getElementById('oled-status').innerHTML=d.message)}";
  chunk += "function oledClear(){fetch('/api/oled-message?message=').then(r=>r.json()).then(d=>document.getElementById('oled-status').innerHTML='Efface')}";
  chunk += "function configOLED(){document.getElementById('oled-status').innerHTML='Reconfiguration...';";
  chunk += "fetch('/api/oled-config?sda='+document.getElementById('oledSDA').value+'&scl='+document.getElementById('oledSCL').value)";
  chunk += ".then(r=>r.json()).then(d=>{if(d.success){alert(d.message);location.reload()}else{alert('Erreur: '+d.message)}})}";
  
  chunk += "function testADC(){document.getElementById('adc-status').innerHTML='Test...';";
  chunk += "fetch('/api/adc-test').then(r=>r.json()).then(data=>{let h='';";
  chunk += "data.readings.forEach(a=>{h+='<div class=\"info-item\"><div class=\"info-label\">GPIO '+a.pin+'</div><div class=\"info-value\">'+a.raw+' ('+a.voltage.toFixed(2)+'V)</div></div>'});";
  chunk += "document.getElementById('adc-results').innerHTML=h;document.getElementById('adc-status').innerHTML=data.result})}";
  
